export const pizzaList = [
    {
        id : 1,
        img: "1",
        name: "Супер гриль",
        composition: ["Охотничьи колбаски", "сосиски", "моцарелла", "баклажан", "томаты", "лук", "перец", "соус томатный", "соус BBQ", "зеленый соус", "майонез"],
        caloricity: 1569,
        price: 249,
    },
    {
        id: 2,
        img: "2",
        name: "Маргарита",
        composition: ["Томаты", "моцарелла", "орегано", "базилик", "соус Pomodoro"],
        caloricity: 1042,
        price: 70,
    },
    {
        id: 3,
        img: "3",
        name: "Карбонара",
        composition: ["Ветчина", "шампиньоны", "пармезан", "моцарелла", "томаты", "яйцо перепелиное", "смесь перцев", "соус Carbonara"],
        caloricity: 1369,
        price: 119,
    },
    {
        id: 4,
        img: "4",
        name: "C сырным бортиком",
        composition: ["Хамон", "моцарелла", "сливочный сыр", "персик", "сливки", "руккола"],
        caloricity: 1140,
        price: 139,
    },
    {
        id: 5,
        img: "5",
        name: "Полло",
        composition: ["Куриное филе sous-vide", "ананас", "моцарелла", "орегано", "перец чили", "соус Pomodoro"],
        caloricity: 1232,
        price: 99,
    },
    {
        id: 6,
        img: "6",
        name: "Пепперони",
        composition: ["Салями Пепперони", "моцарелла", "орегано", "соус Pomodoro"],
        caloricity: 1280,
        price: 119,
    },
    {
        id: 7,
        img: "7",
        name: "Гурмео",
        composition: ["Охотничьи колбаски", "салями пепперони", "ветчина", "куриное филе sous-vide", "шампиньоны", "орегано", "соус BBQ"],
        caloricity: 1343,
        price: 149,
    },
    {
        id: 8,
        img: "8",
        name: "Четыре сыра",
        composition: ["Пармезан", "дор блю", "чеддер", "моцарелла", "груша", "грецкий орех", "соус сливочный"],
        caloricity: 1220,
        price: 109,
    },
    {
        id: 9,
        img: "9",
        name: "Американо",
        composition: ["Куриное филе sous-vide", "салями", "пепперони", "охотничьи колбаски", "кукуруза", "моцарелла", "лук", "орегано", "соус Pomodoro", "соус BBQ"],
        caloricity: 1422,
        price: 149,
    },
    {
        id: 10,
        img: "10",
        name: "Кальцоне",
        composition: ["Ветчина", "шампиньоны", "дор блю", "моцарелла", "томаты", "орегано"],
        caloricity: 1056,
        price: 99,
    },
    {
        id: 11,
        img: "11",
        name: "Берлускони",
        composition: ["Сливочный соус из белых грибов и шампиньонов с трюфельным маслом", "моцарелла", "дор блю", "орегано", "лук"],
        caloricity: 1293,
        price: 125,
    },
    {
        id: 12,
        img: "12",
        name: "Супер гриль",
        composition: ["Охотничьи колбаски", "сосиски", "сыр моцарелла", "баклажан", "томаты", "лук", "перец", "соус томатный"],
        caloricity: 1410,
        price: 132,
    },
    {
        id: 13,
        img: "13",
        name: "Кампанья",
        composition: ["Охотничьи колбаски", "ветчина", "салями пепперони", "куриное филе sous-vide", "шампиньоны", "моцарелла", "томаты"],
        caloricity: 1510,
        price: 144,
    },
    {
        id: 14,
        img: "14",
        name: "Дьявола",
        composition: ["Горчичный соус", "моцарелла", "молочные сосиски", "бекон", "помидор", "зелень"],
        caloricity: 1180,
        price: 107,
    },
    {
        id: 15,
        img: "15",
        name: "Бекон ранч",
        composition: ["Фирменный пицца-соус", "моцарелла", "бекон", "ветчина", "телятина", "помидор", "перец болгарский", "соус ранч"],
        caloricity: 1322,
        price: 113,
    },
    {
        id: 16,
        img: "16",
        name: "Гроссето",
        composition: ["Фирменный пицца-соус", "моцарелла", "лосось", "креветки", "сладкий перец", "маслины", "лимон", "базилик", "орегано"],
        caloricity: 980,
        price: 159,
    },
    {
        id: 17,
        img: "17",
        name: "Тоскана",
        composition: ["Фирменный пицца-соус", "моцарелла", "ветчина", "бекон", "салями-пеперони", "сладкий перец", "сыр «Пармезан»", "базилик", "орегано"],
        caloricity: 1310,
        price: 139,
    },
    {
        id: 18,
        img: "18",
        name: "Грибная",
        composition: ["Фирменный пицца-соус", "моцарелла", "шампиньоны", "опята", "маслины", "лук", "базилик", "орегано", "зелень"],
        caloricity: 1451,
        price: 132,
    },
    {
        id: 19,
        img: "19",
        name: "Туринская",
        composition: ["Горчичный соус", "моцарелла", "салями", "охотничьи колбаски", "огурцы маринованные", "зелень"],
        caloricity: 1140,
        price: 138,
    },
    {
        id: 20,
        img: "20",
        name: "Венецианская",
        composition: ["Фирменный пицца-соус", "моцарелла", "телятина", "куриная грудка", "бекон", "шампиньоны", "помидор", "перец", "пармезан", "зелень"],
        caloricity: 1341,
        price: 142,
    },
    {
        id: 21,
        img: "21",
        name: "Четыре сезона",
        composition: ["Фирменный пицца-соус", "моцарелла", "опята", "куриная грудка", "помидор", "перец", "лук", "шампиньоны", "пармезан", "зелень"],
        caloricity: 1479,
        price: 145,
    },
];

function CreatePizza({img, name, composition, caloricity, price}) {
    this.id = CreatePizza._id++;
    this.img = img;
    this.name = name;
    this.composition = composition;
    this.caloricity = caloricity;
    this.price = price;
    this.isFavourite = false;
}
CreatePizza._id = 1;

export const createPiazzaArrayByClass = pizzaList => [...pizzaList].map(item => new CreatePizza(item));